/*
*************************************************************************************
**文件说明：任务
**文件名称：task.h 
**创建日期：2013.11.07  
**创 建 人：王玮
**-----------------------------------------------------------------------------------
**修改日期：2013.xx.xx
**修改说明：
*************************************************************************************
*/
#ifndef TASK_H
#define TASK_H

/***************************************************
任务堆栈大小
****************************************************/
#define START_STK_SIZE   64
#define LED_STK_SIZE     64
#define RTC_STK_SIZE     64



/***************************************************
设置任务优先级
****************************************************/
#define LED0_TASK_Prio      6
#define LED1_TASK_Prio      7
#define LED2_TASK_Prio      8
#define RTC_TASK_Prio       9


#define START_TASK_Prio     3




extern void TaskStart(void *pdata);

#endif
