/*
*************************************************************************************
**文件说明：数据类型定义文件
**文件名称：user_type.h 
**创建日期：2009.07.21  
**创 建 人：王玮
**-----------------------------------------------------------------------------------
**修改日期：2013.xx.xx
**修改说明：
*************************************************************************************
*/


#ifndef USER_TYPE_H
#define USER_TYPE_H
/*
------------------------------------------------------------------------------------
说明：数据类型，位长度。
------------------------------------------------------------------------------------
*/
typedef unsigned char       Bool;
typedef unsigned char       Uint8;
typedef unsigned short int  Uint16;
typedef unsigned int        Uint32;
typedef signed char         Int8;
typedef signed short int    Int16;
typedef signed int          Int32;
typedef float               Float32;


/*
-------------------------------------------------------------------------------------
说明: USB命令码
-------------------------------------------------------------------------------------
*/
typedef struct 
{
	Uint8 Cmd;
	Uint8 CmdPar[7];
}USBCmd;

		
#endif
