/*
*************************************************************************************
**文件说明：配置文件
**文件名称： user_cfg.h 
**创建日期：2009.07.21  
**创 建 人：王玮
**-----------------------------------------------------------------------------------
**修改日期：2013.xx.xx
**修改说明：
*************************************************************************************
*/
#ifndef USER_CFG_H
#define USER_CFG_H

#include "user_type.h"
#include "stm32f10x.h"
#include "drivers.h"




/***************************************************************
**说明: 版本号
****************************************************************/
#define VERSION  (1.1)

/***************************************************************
**说明: 调试版本 0为运行版本 1为软件调试版本 2为硬件调试版本
****************************************************************/
#define DEBUG    (0)


/*
-------------------------------------------------------------------------------------
说明: 真假值
-------------------------------------------------------------------------------------

typedef enum {TRUE = 1, FLASE = !TRUE} BoolStatus;
*/
/*
-------------------------------------------------------------------------------------
说明: 8bit位掩码 
-------------------------------------------------------------------------------------
*/
typedef enum{
	MASK_BIT0 = 0x01,
	MASK_BIT1 = 0x02,
	MASK_BIT2 = 0x04,
	MASK_BIT3 = 0x08,
	MASK_BIT4 = 0x10,
	MASK_BIT5 = 0x20,
	MASK_BIT6 = 0x40,
	MASK_BIT7 = 0x80,
}BIT_MASK;

//---------------------------------------------------------------------------------
//说明：  Set or clear all bits in the mask
//---------------------------------------------------------------------------------

#define ClearMask(addr,mask) addr = (addr & ~(mask))
#define SetMask(addr,mask) addr = (addr | (mask))
#define SeeMask(addr,mask) addr = (addr & mask) 

#define ReadMask(addr,mask) (addr & (mask))
#define WriteMask(addr,data,mask) addr = (addr & ~(mask)) | (data)
#define AntiMask(addr,mask) addr=(addr | mask) & ~(addr & mask) 



#endif



