/*
*************************************************************************************
**文件说明：fsmc配置
**文件名称： fsmc_cfg.h 
**创建日期：2013.11.06  
**创 建 人：王玮
**-----------------------------------------------------------------------------------
**修改日期：2013.xx.xx
**修改说明：
*************************************************************************************
*/
#ifndef FSMC_CFG_H
#define FSMC_CFG_H
#include "user_type.h"
#include "stm32f10x.h"

/**************************************************
说明：FSMC端口配置掩码
可根据工程需要继续添加，并在代码文件中添加相应处理。
**************************************************/
#define  EN_FSMC_PSRAM       ((Uint16)0x0001)
         


/*
*************************************************************************************
* 名    称：void FSMC_Config(Uint16 FSMCMask,FunctionalState NewState)
* 功    能：FSMC配置
* 入口参数：Uint16 FSMCMask 功能掩码
            FunctionalState NewState
            ENABLE    开启
            DISABLE   关闭
* 出口参数：无
*************************************************************************************
*/
extern void FSMC_Config(Uint16 FSMCMask,FunctionalState NewState);



#endif






